* Android
** STARTED [[http://design-patterns.readthedocs.io/zh_CN/latest/read_uml.html][UML类图和时序图]]
   :LOGBOOK:
   CLOCK: [2016-09-18 周日 14:06]--[2016-09-18 周日 14:20] =>  0:14
   :END:
** STARTED [[https://github.com/simple-android-framework-exchange/android_design_patterns_analysis][android设计模式]]
   :LOGBOOK:
   CLOCK: [2016-09-18 周日 14:27]--[2016-09-18 周日 14:53] => 0:26
   :END:
** 四大组件
*** STARTED [[http://blog.csdn.net/guolin_blog/article/details/11952435][service]]
    :LOGBOOK:
    CLOCK: [2016-09-18 周日 15:00]--[2016-09-18 周日 15:29] => 0:29
    :END:
** STARTED [[http://gityuan.com/2015/10/31/binder-prepare/][binder]]
   :LOGBOOK:
   CLOCK: [2017-02-11 周六 10:40]--[2017-02-11 周六 11:05] =>  0:25
   :END:
** [[https://drakeet.me/effective-multitype][multilType]]
** STARTED [[http://www.gcssloop.com/customview/CustomViewIndex][自定义view]]
   :LOGBOOK:
   CLOCK: [2017-02-11 周六 09:57]--[2017-02-11 周六 10:22] =>  0:25
   CLOCK: [2017-02-09 周四 21:54]--[2017-02-09 周四 22:19] =>  0:25
   CLOCK: [2017-02-08 周三 13:25]--[2017-02-08 周三 13:50] =>  0:25
   CLOCK: [2017-02-05 周日 11:24]--[2017-02-05 周日 11:49] =>  0:25
   CLOCK: [2017-02-04 周六 14:56]--[2017-02-04 周六 15:21] =>  0:25
   CLOCK: [2017-02-03 周五 16:42]--[2017-02-03 周五 17:07] =>  0:25
   CLOCK: [2016-09-20 周二 17:08]--[2016-09-20 周二 17:33] =>  0:25
   :END:
** STARTED [[https://hltj.gitbooks.io/kotlin-reference-chinese/content/txt/getting-started.html][kotlin]]
   :LOGBOOK:
   CLOCK: [2016-11-25 周五 17:41]--[2016-11-26 周六 10:11] => 16:30
   CLOCK: [2016-11-24 周四 17:48]--[2016-11-24 周四 18:13] =>  0:25
   CLOCK: [2016-11-23 周三 16:31]--[2016-11-23 周三 16:56] =>  0:25
   CLOCK: [2016-11-20 周日 00:01]--[2016-11-20 周日 00:26] =>  0:25
   CLOCK: [2016-09-25 周日 20:08]--[2016-09-25 周日 20:14] =>  0:06
   CLOCK: [2016-09-22 周四 13:11]--[2016-09-22 周四 13:36] =>  0:25
   CLOCK: [2016-09-21 周三 11:00]--[2016-09-21 周三 11:25] =>  0:25
   :END:
** STARTED [[https://wangjiegulu.gitbooks.io/kotlin-for-android-developers-zh/content/jie_wei.html][kotlin for android developers]]
   :LOGBOOK:
   CLOCK: [2016-11-23 周三 22:10]--[2016-11-23 周三 22:35] =>  0:25
   CLOCK: [2016-11-23 周三 14:42]--[2016-11-23 周三 15:07] =>  0:25
   CLOCK: [2016-11-22 周二 13:43]--[2016-11-22 周二 14:08] =>  0:25
   CLOCK: [2016-11-21 周一 22:11]--[2016-11-21 周一 22:36] =>  0:25
   CLOCK: [2016-11-20 周日 15:00]--[2016-11-20 周日 15:25] =>  0:25
   CLOCK: [2016-11-19 周六 23:15]--[2016-11-19 周六 23:40] =>  0:25
   :END:
** STARTED todo[80%]
   :LOGBOOK:
   CLOCK: [2016-12-06 周二 19:28]--[2016-12-06 周二 19:53] =>  0:25
   CLOCK: [2016-12-04 周日 20:26]--[2016-12-04 周日 20:51] =>  0:25
   CLOCK: [2016-11-30 周三 14:42]--[2016-11-30 周三 15:07] =>  0:25
   CLOCK: [2016-11-30 周三 14:11]--[2016-11-30 周三 14:36] =>  0:25
   CLOCK: [2016-11-30 周三 13:34]--[2016-11-30 周三 13:59] =>  0:25
   CLOCK: [2016-11-30 周三 11:41]--[2016-11-30 周三 11:58] =>  0:17
   CLOCK: [2016-11-30 周三 11:01]--[2016-11-30 周三 11:26] =>  0:25
   CLOCK: [2016-11-30 周三 10:25]--[2016-11-30 周三 10:50] =>  0:25
   CLOCK: [2016-11-30 周三 09:39]--[2016-11-30 周三 10:04] =>  0:25
   CLOCK: [2016-11-29 周二 16:21]--[2016-11-29 周二 16:46] =>  0:25
   CLOCK: [2016-11-29 周二 15:35]--[2016-11-29 周二 16:00] =>  0:25
   CLOCK: [2016-11-29 周二 15:04]--[2016-11-29 周二 15:29] =>  0:25
   CLOCK: [2016-11-29 周二 14:26]--[2016-11-29 周二 14:51] =>  0:25
   CLOCK: [2016-11-29 周二 13:34]--[2016-11-29 周二 13:59] =>  0:25
   CLOCK: [2016-11-28 周一 16:45]--[2016-11-28 周一 17:10] =>  0:25
   CLOCK: [2016-11-28 周一 16:07]--[2016-11-28 周一 16:32] =>  0:25
   CLOCK: [2016-11-28 周一 15:32]--[2016-11-28 周一 15:57] =>  0:25
   CLOCK: [2016-11-28 周一 14:31]--[2016-11-28 周一 14:56] =>  0:25
   CLOCK: [2016-11-28 周一 12:58]--[2016-11-28 周一 13:18] =>  0:20
   CLOCK: [2016-11-28 周一 11:30]--[2016-11-28 周一 11:45] =>  0:15
   CLOCK: [2016-11-28 周一 10:43]--[2016-11-28 周一 11:08] =>  0:25
   CLOCK: [2016-11-28 周一 09:36]--[2016-11-28 周一 10:01] =>  0:25
   CLOCK: [2016-11-27 周日 15:10]--[2016-11-27 周日 15:35] =>  0:25
   CLOCK: [2016-11-27 周日 13:54]--[2016-11-27 周日 14:19] =>  0:25
   CLOCK: [2016-11-27 周日 12:59]--[2016-11-27 周日 13:24] =>  0:25
   CLOCK: [2016-11-26 周六 17:06]--[2016-11-26 周六 17:31] =>  0:25
   CLOCK: [2016-11-26 周六 16:28]--[2016-11-26 周六 16:53] =>  0:25 videoFragment multipleViewType
   CLOCK: [2016-11-26 周六 15:37]--[2016-11-26 周六 16:02] =>  0:25
   CLOCK: [2016-11-26 周六 14:57]--[2016-11-26 周六 15:22] =>  0:25
   CLOCK: [2016-11-26 周六 14:10]--[2016-11-26 周六 14:35] =>  0:25
   CLOCK: [2016-11-26 周六 12:18]--[2016-11-26 周六 12:43] =>  0:25
   CLOCK: [2016-11-26 周六 11:09]--[2016-11-26 周六 11:34] =>  0:25
   CLOCK: [2016-11-26 周六 10:11]--[2016-11-26 周六 10:36] =>  0:25
   CLOCK: [2016-11-25 周五 17:05]--[2016-11-25 周五 17:30] =>  0:25
   CLOCK: [2016-11-25 周五 16:12]--[2016-11-25 周五 16:37] =>  0:25
   CLOCK: [2016-11-25 周五 15:26]--[2016-11-25 周五 15:51] =>  0:25
   CLOCK: [2016-11-25 周五 14:56]--[2016-11-25 周五 15:21] =>  0:25
   CLOCK: [2016-11-25 周五 14:12]--[2016-11-25 周五 14:37] =>  0:25
   CLOCK: [2016-11-25 周五 13:37]--[2016-11-25 周五 14:02] =>  0:25
   CLOCK: [2016-11-25 周五 11:25]--[2016-11-25 周五 11:50] =>  0:25
   CLOCK: [2016-11-25 周五 10:32]--[2016-11-25 周五 10:57] =>  0:25
   CLOCK: [2016-11-25 周五 09:56]--[2016-11-25 周五 10:21] =>  0:25
   CLOCK: [2016-11-25 周五 09:23]--[2016-11-25 周五 09:48] =>  0:25
   CLOCK: [2016-11-24 周四 17:07]--[2016-11-24 周四 17:32] =>  0:25
   CLOCK: [2016-11-24 周四 15:16]--[2016-11-24 周四 15:41] =>  0:25
   CLOCK: [2016-11-24 周四 14:29]--[2016-11-24 周四 14:54] =>  0:25
   CLOCK: [2016-11-24 周四 13:52]--[2016-11-24 周四 14:17] =>  0:25
   CLOCK: [2016-11-24 周四 13:17]--[2016-11-24 周四 13:42] =>  0:25 修改wxpay
   CLOCK: [2016-11-24 周四 12:45]--[2016-11-24 周四 13:10] =>  0:25
   CLOCK: [2016-11-24 周四 11:29]--[2016-11-24 周四 11:54] =>  0:25
   CLOCK: [2016-11-24 周四 10:51]--[2016-11-24 周四 11:16] =>  0:25
   CLOCK: [2016-11-24 周四 10:17]--[2016-11-24 周四 10:42] =>  0:25
   CLOCK: [2016-11-24 周四 09:27]--[2016-11-24 周四 09:52] =>  0:25
   CLOCK: [2016-11-23 周三 17:05]--[2016-11-23 周三 17:30] =>  0:25
   CLOCK: [2016-11-23 周三 15:46]--[2016-11-23 周三 16:11] =>  0:25
   CLOCK: [2016-11-23 周三 15:13]--[2016-11-23 周三 15:38] =>  0:25
   :END:
**** DONE 评论的展开
     CLOSED: [2016-10-06 周四 11:25]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-10-06 周四 11:25]
     CLOCK: [2016-10-06 周四 10:23]--[2016-10-06 周四 11:25] =>  1:02
     CLOCK: [2016-10-06 周四 09:55]--[2016-10-06 周四 10:08] =>  0:13
     :END:
**** DONE 消息列表的系统消息
     CLOSED: [2016-10-13 周四 10:44]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-10-13 周四 10:44]
     CLOCK: [2016-10-07 周五 10:28]--[2016-10-07 周五 11:36] =>  1:08
     CLOCK: [2016-10-07 周五 09:30]--[2016-10-07 周五 10:03] =>  0:33
     :END:
**** DONE [[https://leancloud.cn/docs/realtime_v2.html][实时通信概览]]
     CLOSED: [2016-10-13 周四 10:44]
     :LOGBOOK:
     - State "DONE"       from "STARTED"    [2016-10-13 周四 10:44]
     CLOCK: [2016-10-06 周四 17:03]--[2016-10-06 周四 19:26] =>  2:23
     :END:
**** DONE 个人页面
     CLOSED: [2016-10-08 周六 10:36]
     :LOGBOOK:
     - State "DONE"       from "TODO"       [2016-10-08 周六 10:36]
     :END:
***** DONE 头像大小,生日选择修改样式
      CLOSED: [2016-10-08 周六 10:36]
      :LOGBOOK:
      - State "DONE"       from "STARTED"    [2016-10-08 周六 10:36]
      CLOCK: [2016-10-07 周五 14:24]--[2016-10-07 周五 15:31] =>  1:07
      CLOCK: [2016-10-06 周四 11:33]--[2016-10-06 周四 12:04] =>  0:31
      :END:
***** DONE 个人相册
      CLOSED: [2016-10-08 周六 10:36]
      :LOGBOOK:
      - State "DONE"       from "STARTED"    [2016-10-08 周六 10:36]
      CLOCK: [2016-10-08 周六 10:13]--[2016-10-08 周六 10:36] =>  0:23
      CLOCK: [2016-10-07 周五 15:35]--[2016-10-07 周五 16:44] =>  1:09
      :END:
**** DONE 邂逅列表修改一下样式
     CLOSED: [2016-11-12 周六 20:04]
     - State "DONE"       from "STARTED"    [2016-11-12 周六 20:04]
     :LOGBOOK:
     CLOCK: [2016-10-06 周四 13:11]--[2016-10-06 周四 14:07] =>  0:56
     CLOCK: [2016-10-06 周四 12:07]--[2016-10-06 周四 12:16] =>  0:09
     :END:
***** STARTED 报名
      :LOGBOOK:
      CLOCK: [2016-10-06 周四 16:09]--[2016-10-06 周四 16:45] =>  0:36
      CLOCK: [2016-10-06 周四 15:19]--[2016-10-06 周四 15:50] =>  0:31
      :END:
***** 过滤掉过时的约会\已经开始的约会
***** 报名时判断金币
**** DONE 给视频发布者送礼物
     CLOSED: [2016-11-12 周六 20:04]
     - State "DONE"       from "TODO"       [2016-11-12 周六 20:04]
     :LOGBOOK:
     CLOCK: [2016-10-13 周四 16:52]--[2016-10-13 周四 17:03] =>  0:11
     :END:

**** DONE 上拉加载
     CLOSED: [2016-11-23 周三 15:13]
     - State "DONE"       from "STARTED"    [2016-11-23 周三 15:13]
**** DONE 单约
     CLOSED: [2016-11-30 周三 09:39]
     - State "DONE"       from "TODO"       [2016-11-30 周三 09:39]
     - State "TODO"       from "DONE"       [2016-11-14 一 19:40]
     - State "DONE"       from "TODO"       [2016-11-14 一 14:07]
***** DONE 约自己的判定,在点约她的时候就判断
      CLOSED: [2016-11-14 一 10:47]
      - State "DONE"       from "TODO"       [2016-11-14 一 10:47]
***** DONE 聊天页面,收到的约会邀请
      CLOSED: [2016-11-14 一 14:06]
      - State "DONE"       from "STARTED"    [2016-11-14 一 14:06]
****** DONE 根据状态确定,单约详情的按钮点击与否,接受后可以聊天
       CLOSED: [2016-11-14 一 14:06]
       - State "DONE"       from "STARTED"    [2016-11-14 一 14:06]
****** DONE 超时自动确认,后台把M币送给视频发布者,并发送消息,修改约会的状态
       CLOSED: [2016-11-14 一 14:06]
       - State "DONE"       from "STARTED"    [2016-11-14 一 14:06]
       :LOGBOOK:
       CLOCK: [2016-11-14 一 13:32]--[2016-11-14 一 13:57] =>  0:25
       CLOCK: [2016-11-14 一 12:57]--[2016-11-14 一 13:22] =>  0:25
       :END:
**** DONE 群约[9/9]
     - State "DONE"       from "TODO"       [2016-11-18 周五 15:28]
***** DONE 待应约列表接受成功后显示约会状态
      CLOSED: [2016-11-14 一 16:26]
      - State "DONE"       from "STARTED"    [2016-11-14 一 16:26]
      :LOGBOOK:
      CLOCK: [2016-11-14 一 15:53]--[2016-11-14 一 16:18] =>  0:25
      CLOCK: [2016-11-14 一 15:07]--[2016-11-14 一 15:32] =>  0:25
      CLOCK: [2016-11-14 一 14:19]--[2016-11-14 一 14:44] =>  0:25
      :END:
***** DONE 修改状态为待确认 start->wait_to_confirm
      CLOSED: [2016-11-14 一 18:53]
      - State "DONE"       from "STARTED"    [2016-11-14 一 18:53]
      :LOGBOOK:
      CLOCK: [2016-11-14 一 17:53]--[2016-11-14 一 18:43] =>  0:50
      CLOCK: [2016-11-14 一 17:14]--[2016-11-14 一 17:39] =>  0:25
      :END:
***** DONE 修改状态为完成 wait_to_confirm->done
      CLOSED: [2016-11-18 周五 12:12]
      - State "DONE"       from "STARTED"    [2016-11-18 周五 12:12]
      :LOGBOOK:
      CLOCK: [2016-11-17 四 09:24]--[2016-11-17 四 09:49] =>  0:25
      CLOCK: [2016-11-16 三 16:18]--[2016-11-16 三 16:43] =>  0:25
      CLOCK: [2016-11-16 三 15:35]--[2016-11-16 三 16:00] =>  0:25
      CLOCK: [2016-11-16 三 15:05]--[2016-11-16 三 15:30] =>  0:25
      :END:
***** DONE wait_to_accept->done_by_system
      CLOSED: [2016-11-18 周五 15:28]
      - State "DONE"       from "TODO"       [2016-11-18 周五 15:28]
***** DONE 群约状态改为超时 wait->out_of_date
      CLOSED: [2016-11-15 二 17:02]
      - State "DONE"       from "STARTED"    [2016-11-15 二 17:02]
      :LOGBOOK:
      CLOCK: [2016-11-15 二 14:28]--[2016-11-15 二 14:53] =>  0:25
      CLOCK: [2016-11-15 二 13:14]--[2016-11-15 二 13:39] =>  0:25
      CLOCK: [2016-11-14 一 16:26]--[2016-11-14 一 16:51] =>  0:25
      :END:
****** DONE 没有接受报名就算超时,修改为outOfDate,并且返还Mcoin
       CLOSED: [2016-11-15 二 16:37]
       - State "DONE"       from "STARTED"    [2016-11-15 二 16:37]
       :LOGBOOK:
       CLOCK: [2016-11-15 二 13:45]--[2016-11-15 二 14:10] =>  0:25
       :END:
******* DONE 修改状态
        CLOSED: [2016-11-15 二 16:00]
        - State "DONE"       from "TODO"       [2016-11-15 二 16:00]
******* DONE 返还coin
        CLOSED: [2016-11-15 二 16:00]
        - State "DONE"       from "TODO"       [2016-11-15 二 16:00]
******** 返还publish_user的coin
******** 返还join_user的coin
****** DONE 超时后不可报名
       CLOSED: [2016-11-15 二 17:01]
       - State "DONE"       from "STARTED"    [2016-11-15 二 17:01]
       - State "STARTED"    from "DONE"       [2016-11-15 二 16:37]
       - State "DONE"       from "STARTED"    [2016-11-15 二 16:37]
       :LOGBOOK:
       CLOCK: [2016-11-15 二 16:00]--[2016-11-15 二 16:25] =>  0:25
       :END:
****** DONE 超时后不能接受
       CLOSED: [2016-11-15 二 16:37]
       - State "DONE"       from "STARTED"    [2016-11-15 二 16:37]
****** DONE 修改appointWall的startTime和endTime,新增发布邀约的接口
       CLOSED: [2016-11-15 二 16:24]
       - State "DONE"       from "STARTED"    [2016-11-15 二 16:24]
       :LOGBOOK:
       CLOCK: [2016-11-15 二 10:27]--[2016-11-15 二 10:52] =>  0:25
       CLOCK: [2016-11-15 二 09:35]--[2016-11-15 二 10:00] =>  0:25
       :END:
***** DONE 发布约会时,后台判断这个时间是否有约,判断Mcoin是否足够
      CLOSED: [2016-11-16 三 14:24]
      - State "DONE"       from "STARTED"    [2016-11-16 三 14:24]
      :LOGBOOK:
      CLOCK: [2016-11-16 三 09:33]--[2016-11-16 三 09:58] =>  0:25
      CLOCK: [2016-11-15 二 17:38]--[2016-11-15 二 17:49] =>  0:11
      CLOCK: [2016-11-15 二 17:05]--[2016-11-15 二 17:30] =>  0:25
      :END:
***** DONE 我的发布约会时,发布成功后,页面finish
      CLOSED: [2016-11-18 周五 15:28]
      - State "DONE"       from "TODO"       [2016-11-18 周五 15:28]
***** DONE 修改状态为超时自动确认
      CLOSED: [2016-11-18 周五 15:28]
      - State "DONE"       from "TODO"       [2016-11-18 周五 15:28]
***** DONE 完成后的确认
      CLOSED: [2016-11-18 周五 15:28]
**** DONE 评论的显示全部
     CLOSED: [2016-11-23 周三 15:13]
     - State "DONE"       from "TODO"       [2016-11-23 周三 15:13]
**** DONE 视频里面职业与年龄
     CLOSED: [2016-11-30 周三 09:39]
     - State "DONE"       from "TODO"       [2016-11-30 周三 09:39]
**** STARTED 消息列表的刷新,点击跳转
**** DONE 我的钱包,充值,提现
     CLOSED: [2016-11-26 周六 16:55]
     - State "DONE"       from "TODO"       [2016-11-26 周六 16:55]
***** DONE 充值
      CLOSED: [2016-10-13 周四 10:45]
      :LOGBOOK:
      - State "DONE"       from              [2016-10-13 周四 10:45]
      :END:
***** 提现
**** DONE 我的喜欢,我的收藏,美丽商城,我的帖子,我的视频
     CLOSED: [2016-11-30 周三 09:39]
     - State "DONE"       from "TODO"       [2016-11-30 周三 09:39]
**** DONE 用户详情页面
     CLOSED: [2016-11-30 周三 09:39]
     - State "DONE"       from "TODO"       [2016-11-30 周三 09:39]
***** DONE 轮播图
      CLOSED: [2016-11-18 周五 15:32]
      - State "DONE"       from              [2016-11-18 周五 15:32]
      :LOGBOOK:
      - State "DONE"       from "STARTED"    [2016-10-13 周四 10:45]
      CLOCK: [2016-10-08 周六 14:07]--[2016-10-08 周六 14:25] =>  0:18
      CLOCK: [2016-10-08 周六 10:39]--[2016-10-08 周六 11:35] =>  0:56
      :END:
***** 视频,动态
***** 送礼物
**** TODO 更新头像时删除旧的头像
**** DONE 新消息提醒
     CLOSED: [2016-11-30 周三 09:39]
     - State "DONE"       from "STARTED"    [2016-11-30 周三 09:39]
     :LOGBOOK:
     CLOCK: [2016-10-13 周四 11:33]--[2016-10-13 周四 11:51] =>  0:18
     CLOCK: [2016-10-13 周四 10:45]--[2016-10-13 周四 11:10] =>  0:25
     :END:
**** DONE 记录交易信息
     CLOSED: [2016-11-23 周三 15:13]
     - State "DONE"       from "TODO"       [2016-11-23 周三 15:13]
**** TODO 分成
**** TODO 退出登录,评论时显示先登录
** STARTED [[http://jcodecraeer.com/a/anzhuokaifa/androidkaifa/2015/0512/2869.html][自定义xmlView]]
   :LOGBOOK:
   CLOCK: [2016-11-23 周三 09:41]--[2016-11-23 周三 10:06] =>  0:25
   :END:
** STARTED java编程思想
   :LOGBOOK:
   CLOCK: [2017-03-09 周四 08:51]--[2017-03-09 周四 09:16] =>  0:25
   CLOCK: [2017-03-07 周二 08:44]--[2017-03-07 周二 08:59] =>  0:15
   :END:
** STARTED [[http://blog.chengyunfeng.com/?p=983][RxJava]]
   :LOGBOOK:
   CLOCK: [2017-02-09 周四 23:39]--[2017-02-10 周五 00:06] =>  0:27
   CLOCK: [2017-02-08 周三 20:37]--[2017-02-08 周三 21:02] =>  0:25
   CLOCK: [2017-02-05 周日 14:45]--[2017-02-05 周日 15:10] =>  0:25
   CLOCK: [2017-01-10 周二 11:49]--[2017-01-10 周二 12:14] =>  0:25
   :END:
*** [[https://mcxiaoke.gitbooks.io/rxdocs/content/Observables.html][ReactiveX中文文档]]
*** [[http://blog.chengyunfeng.com/?p=948][云在千峰]]
*** [[http://blog.chengyunfeng.com/?p=959][创建事件流]]
** STARTED 会办
*** needfix
**** DONE 一会就断线
     CLOSED: [2017-03-13 周一 16:43]
     - State "DONE"       from              [2017-03-13 周一 16:43]
**** 崩溃后页面重叠
*** 我的小店
**** 添加商品页
*** DONE 3.13 周一
    CLOSED: [2017-03-14 周二 09:05]
    - State "DONE"       from "STARTED"    [2017-03-14 周二 09:05]
    :LOGBOOK:
    CLOCK: [2017-03-13 周一 14:24]--[2017-03-13 周一 14:49] =>  0:25
    :END:
**** DONE 小键盘隐藏
     CLOSED: [2017-03-13 周一 14:59]
     - State "DONE"       from "TODO"       [2017-03-13 周一 14:59]
***** DONE 朋友圈发布时
      CLOSED: [2017-03-13 周一 14:02]
      - State "DONE"       from              [2017-03-13 周一 14:02]
***** DONE 客户管理-添加反馈
      CLOSED: [2017-03-13 周一 14:12]
      - State "DONE"       from              [2017-03-13 周一 14:12]
***** DONE 审批-采购
      CLOSED: [2017-03-13 周一 14:27]
      - State "DONE"       from              [2017-03-13 周一 14:27]
***** DONE 审批-报销
      CLOSED: [2017-03-13 周一 17:00]
      - State "DONE"       from              [2017-03-13 周一 17:00]
**** DONE 左上角崩溃
     CLOSED: [2017-03-13 周一 14:55]
     - State "DONE"       from              [2017-03-13 周一 14:55]
***** DONE 项目-新建项目-添加成员-左上角返回崩溃
      CLOSED: [2017-03-13 周一 14:55]
      - State "DONE"       from              [2017-03-13 周一 14:55]
***** DONE 审批-其他-选择审批人-左上角返回崩溃
      CLOSED: [2017-03-13 周一 14:36]
      - State "DONE"       from              [2017-03-13 周一 14:36]
***** DONE 审批-付款-选择审批人-左上角返回崩溃
      CLOSED: [2017-03-13 周一 14:36]
      - State "DONE"       from              [2017-03-13 周一 14:36]
***** DONE 审批-报销-选择审批人-左上角返回崩溃
      CLOSED: [2017-03-13 周一 14:36]
      - State "DONE"       from              [2017-03-13 周一 14:36]
***** DONE 填写报表左上角返回崩溃
      CLOSED: [2017-03-13 周一 14:01]
      - State "DONE"       from "STARTED"    [2017-03-13 周一 14:01]
      :LOGBOOK:
      CLOCK: [2017-03-13 周一 13:46]--[2017-03-13 周一 14:00] =>  0:14
      :END:
**** DONE 底部导航字靠下
     CLOSED: [2017-03-13 周一 15:08]
     - State "DONE"       from "STARTED"    [2017-03-13 周一 15:08]
     :LOGBOOK:
     CLOCK: [2017-03-13 周一 15:05]--[2017-03-13 周一 15:08] =>  0:03
     :END:
**** DONE 日报填写不完整时的提示
**** DONE 朋友圈添加动态后,返回到朋友圈
     CLOSED: [2017-03-13 周一 15:58]
     - State "DONE"       from "STARTED"    [2017-03-13 周一 15:58]
     :LOGBOOK:
     CLOCK: [2017-03-13 周一 15:53]--[2017-03-13 周一 15:58] =>  0:05
     :END:
**** DONE 个人小店,无法添加商品bug(返回值是-400)
     CLOSED: [2017-03-13 周一 17:49]
     - State "DONE"       from              [2017-03-13 周一 17:49]
*** DONE 3.14  
    CLOSED: [2017-03-15 周三 09:44]
    - State "DONE"       from "STARTED"    [2017-03-15 周三 09:44]
    :LOGBOOK:
    CLOCK: [2017-03-14 周二 09:05]--[2017-03-14 周二 09:21] =>  0:16
    :END:
**** DONE 上线1.2.6
     CLOSED: [2017-03-14 周二 09:21]
     - State "DONE"       from              [2017-03-14 周二 09:21]
**** DONE 报销
     CLOSED: [2017-03-14 周二 14:18]
     - State "DONE"       from "STARTED"    [2017-03-14 周二 14:18]
     :LOGBOOK:
     CLOCK: [2017-03-14 周二 11:14]--[2017-03-14 周二 11:39] =>  0:25
     CLOCK: [2017-03-14 周二 10:44]--[2017-03-14 周二 11:09] =>  0:25
     CLOCK: [2017-03-14 周二 09:21]--[2017-03-14 周二 09:30] =>  0:09
     CLOCK: [2017-03-13 周一 16:35]--[2017-03-13 周一 17:00] =>  0:25
     :END:
***** DONE 审批-报销空判断
      CLOSED: [2017-03-13 周一 17:08]
      - State "DONE"       from              [2017-03-13 周一 17:08]
***** DONE 审批-报销,金额可以输入汉字
      CLOSED: [2017-03-13 周一 16:56]
      - State "DONE"       from              [2017-03-13 周一 16:56]
***** DONE 审批-待审批-待报销详情(新增页面)(数据结构和以前不同）
      CLOSED: [2017-03-14 周二 14:18]
      - State "DONE"       from "STARTED"    [2017-03-14 周二 14:18]
      :LOGBOOK:
      CLOCK: [2017-03-14 周二 13:50]--[2017-03-14 周二 14:15] =>  0:25
      CLOCK: [2017-03-14 周二 09:36]--[2017-03-14 周二 10:01] =>  0:25
      CLOCK: [2017-03-13 周一 17:21]--[2017-03-13 周一 17:46] =>  0:25
      :END:
****** DONE 通过
       CLOSED: [2017-03-14 周二 14:17]
       - State "DONE"       from              [2017-03-14 周二 14:17]
****** DONE 不通过
       CLOSED: [2017-03-14 周二 14:17]
       - State "DONE"       from              [2017-03-14 周二 14:17]
*** DONE 3.15周三
    CLOSED: [2017-03-16 周四 12:01]
    - State "DONE"       from              [2017-03-16 周四 12:01]
**** DONE 朋友圈
     CLOSED: [2017-03-15 周三 12:27]
     - State "DONE"       from "STARTED"    [2017-03-15 周三 12:27]
     :LOGBOOK:
     CLOCK: [2017-03-15 周三 11:07]--[2017-03-15 周三 11:32] =>  0:25
     CLOCK: [2017-03-15 周三 10:20]--[2017-03-15 周三 10:45] =>  0:25
     CLOCK: [2017-03-15 周三 09:44]--[2017-03-15 周三 10:09] =>  0:25
     :END:
**** DONE 生日和性别的选择
     CLOSED: [2017-03-15 周三 11:57]
     - State "DONE"       from              [2017-03-15 周三 11:57]
**** DONE 上线版本1.2.7
     CLOSED: [2017-03-15 周三 15:09]
     - State "DONE"       from "STARTED"    [2017-03-15 周三 15:09]
     :LOGBOOK:
     CLOCK: [2017-03-15 周三 14:53]--[2017-03-15 周三 15:09] =>  0:16
     :END:
**** DONE 改数据报表为查看报表
     CLOSED: [2017-03-15 周三 15:09]
     - State "DONE"       from              [2017-03-15 周三 15:09]
**** STARTED 审批-报销(页面变更)
     :LOGBOOK:
     CLOCK: [2017-03-15 周三 15:19]--[2017-03-15 周三 15:27] =>  0:08
     :END:
**** DONE 版本更新界面调整
     CLOSED: [2017-03-15 周三 17:35]
     - State "DONE"       from "STARTED"    [2017-03-15 周三 17:35]
     :LOGBOOK:
     CLOCK: [2017-03-15 周三 17:24]--[2017-03-15 周三 17:35] =>  0:11
     :END:
*** STARTED 3.16周四
**** DONE 填写报表-日报(页面变更)
     CLOSED: [2017-03-16 周四 12:02]
     - State "DONE"       from "STARTED"    [2017-03-16 周四 12:02]
     :LOGBOOK:
     CLOCK: [2017-03-16 周四 09:57]--[2017-03-16 周四 10:22] =>  0:25
     CLOCK: [2017-03-16 周四 09:16]--[2017-03-16 周四 09:41] =>  0:25
     CLOCK: [2017-03-15 周三 20:04]--[2017-03-15 周三 20:29] =>  0:25
     CLOCK: [2017-03-15 周三 19:20]--[2017-03-15 周三 19:45] =>  0:25
     CLOCK: [2017-03-15 周三 18:32]--[2017-03-15 周三 18:57] =>  0:25
     CLOCK: [2017-03-15 周三 17:50]--[2017-03-15 周三 18:02] =>  0:12
     CLOCK: [2017-03-15 周三 17:36]--[2017-03-15 周三 17:49] =>  0:13
     CLOCK: [2017-03-15 周三 17:08]--[2017-03-15 周三 17:24] =>  0:16
     CLOCK: [2017-03-15 周三 16:39]--[2017-03-15 周三 17:04] =>  0:25
     CLOCK: [2017-03-15 周三 16:12]--[2017-03-15 周三 16:37] =>  0:25
     CLOCK: [2017-03-15 周三 15:28]--[2017-03-15 周三 15:44] =>  0:16
     :END:
***** DONE recyclerview添加footer
      CLOSED: [2017-03-15 周三 19:20]
      - State "DONE"       from              [2017-03-15 周三 19:20]
***** DONE 日报图片选择
      CLOSED: [2017-03-16 周四 10:21]
      - State "DONE"       from              [2017-03-16 周四 10:21]
***** DONE 日报审批人选择
      CLOSED: [2017-03-16 周四 11:41]
      - State "DONE"       from "STARTED"    [2017-03-16 周四 11:41]
      :LOGBOOK:
      CLOCK: [2017-03-16 周四 10:29]--[2017-03-16 周四 10:54] =>  0:25
      :END:
***** DONE 发表完日报返回上一层
      CLOSED: [2017-03-16 周四 11:59]
      - State "DONE"       from              [2017-03-16 周四 11:59]
***** DONE 日报commit
      CLOSED: [2017-03-16 周四 11:59]
      - State "DONE"       from "STARTED"    [2017-03-16 周四 11:59]
      :LOGBOOK:
      CLOCK: [2017-03-16 周四 11:44]--[2017-03-16 周四 11:59] =>  0:15
      :END:
**** DONE 周报crash
     CLOSED: [2017-03-16 周四 12:29]
     - State "DONE"       from "STARTED"    [2017-03-16 周四 12:29]
     :LOGBOOK:
     CLOCK: [2017-03-16 周四 12:02]--[2017-03-16 周四 12:09] =>  0:07
     :END:
**** DONE 月报crash
     CLOSED: [2017-03-16 周四 13:38]
     - State "DONE"       from "STARTED"    [2017-03-16 周四 13:38]
     :LOGBOOK:
     CLOCK: [2017-03-16 周四 13:33]--[2017-03-16 周四 13:38] =>  0:05
     :END:
**** DONE 业绩报表crash
     CLOSED: [2017-03-16 周四 13:52]
     - State "DONE"       from "STARTED"    [2017-03-16 周四 13:52]
     :LOGBOOK:
     CLOCK: [2017-03-16 周四 13:39]--[2017-03-16 周四 13:52] =>  0:13
     :END:
*** 会办another
**** STARTED 审批activity
     :LOGBOOK:
     CLOCK: [2017-03-13 周一 22:27]--[2017-03-13 周一 22:52] =>  0:25
     :END:
***** DONE 创建 
      CLOSED: [2017-03-13 周一 22:54]
      - State "DONE"       from              [2017-03-13 周一 22:
**** DONE TeamFragment加载慢
     CLOSED: [2017-03-13 周一 23:30]
     - State "DONE"       from              [2017-03-13 周一 23:30]
** android笔试面试题
*** [[http://www.100mian.com/mianshi/android/49868.html][避免oom]]
* STARTED [[https://classroom.udacity.com/nanodegrees/nd009/parts/0091345400/modules/009134540075460/lessons/6d6c5cc6-08eb-4e8b-8408-854e49584028/concepts/9556c8b3-6593-49b3-a44d-ef83febc6447][MachineLeanring]]
  :LOGBOOK:
  CLOCK: [2016-12-13 周二 22:55]--[2016-12-13 周二 23:20] =>  0:25
  CLOCK: [2016-12-12 周一 23:34]--[2016-12-12 周一 23:59] =>  0:25
  CLOCK: [2016-12-07 周三 20:01]--[2016-12-07 周三 20:26] =>  0:25
  CLOCK: [2016-12-06 周二 20:49]--[2016-12-06 周二 21:14] =>  0:25
  :END:
* nodejs
** STARTED [[http://www.liaoxuefeng.com/wiki/001434446689867b27157e896e74d51a89c25cc8b43bdb3000/00143449917624134f5c4695b524e81a581ab5a222b05ec000][js廖雪峰]]
   :LOGBOOK:
   CLOCK: [2016-09-25 周日 19:27]--[2016-09-25 周日 19:52] =>  0:25
   CLOCK: [2016-09-24 周六 10:58]--[2016-09-24 周六 11:23] =>  0:25
   CLOCK: [2016-09-22 周四 12:13]--[2016-09-22 周四 12:38] =>  0:25
   CLOCK: [2016-09-21 周三 09:53]--[2016-09-21 周三 10:18] =>  0:25
   CLOCK: [2016-09-20 周二 16:27]--[2016-09-20 周二 16:52] =>  0:25
   :END:
** STARTED [[https://git.oschina.net/zzparkour/heiye-server][TechneServer]]
   :LOGBOOK:
   CLOCK: [2016-09-27 周二 15:17]--[2016-09-27 周二 15:42] =>  0:25
   CLOCK: [2016-09-27 周二 14:20]--[2016-09-27 周二 14:45] =>  0:25
   CLOCK: [2016-09-27 周二 13:43]--[2016-09-27 周二 14:08] =>  0:25
   CLOCK: [2016-09-27 周二 13:08]--[2016-09-27 周二 13:33] =>  0:25
   CLOCK: [2016-09-26 周一 17:37]--[2016-09-26 周一 18:02] =>  0:25
   CLOCK: [2016-09-26 周一 17:06]--[2016-09-26 周一 17:31] =>  0:25
   CLOCK: [2016-09-24 周六 15:05]--[2016-09-24 周六 15:30] =>  0:25 babel
   :END:
*** STARTED [[https://blog.leancloud.cn/3910/][setBabel]]
    :LOGBOOK:
    CLOCK: [2016-09-26 周一 16:39]--[2016-09-26 周一 17:04] =>  0:25
    CLOCK: [2016-09-26 周一 14:14]--[2016-09-26 周一 14:39] =>  0:25
    CLOCK: [2016-09-24 周六 15:42]--[2016-09-24 周六 17:35] =>  1:53
    :END:
*** CANCELLED [[http://liubin.org/promises-book/][JSPromise]]
    CLOSED: [2016-11-12 周六 20:14]
    - State "CANCELLED"  from "STARTED"    [2016-11-12 周六 20:14] \\
      感觉写的很绕
    :LOGBOOK:
    CLOCK: [2016-09-27 周二 09:49]--[2016-09-27 周二 10:14] =>  0:25
    CLOCK: [2016-09-27 周二 09:16]--[2016-09-27 周二 09:41] =>  0:25
    :END:
** STARTED [[https://cnodejs.org/topic/560dbc826a1ed28204a1e7de][promise]]
   :LOGBOOK:
   CLOCK: [2016-11-19 周六 10:50]--[2016-11-19 周六 11:15] =>  0:25
   :END:
** DONE hexo
   CLOSED: [2016-11-12 周六 19:50]
   - State "DONE"       from "STARTED"    [2016-11-12 周六 19:50]
   :LOGBOOK:
   CLOCK: [2016-09-29 周四 10:01]--[2016-09-29 周四 10:15] =>  0:14
   :END:
** DONE rongcloud
   CLOSED: [2016-09-14 周三 09:43]
   :LOGBOOK:
   - State "DONE"       from "STARTED"    [2016-09-14 周三 09:43]
   CLOCK: [2016-09-13 周二 09:23]--[2016-09-13 周二 12:00] =>  2:37
   CLOCK: [2016-09-12 周一 16:32]--[2016-09-12 周一 18:12] =>  1:40
   :END:
** DONE [[https://leancloud.cn/docs/rest_api.html][leanCloud restapi]]
   CLOSED: [2016-11-12 周六 19:50]
   - State "DONE"       from "STARTED"    [2016-11-12 周六 19:50]
   :LOGBOOK:
   CLOCK: [2016-10-06 周四 14:42]--[2016-10-06 周四 15:15] =>  0:33
   :END:
* python
** STARTED [[https://wizardforcel.gitbooks.io/think-python-2e/content/11.html][python tutorial]]
   :LOGBOOK:
   CLOCK: [2016-09-18 周日 12:40]--[2016-09-18 周日 13:05] =>  0:25
   CLOCK: [2016-09-18 周日 11:33]--[2016-09-18 周日 11:58] =>  0:25
   CLOCK: [2016-09-18 周日 10:55]--[2016-09-18 周日 11:22] =>  0:27
   CLOCK: [2016-09-14 周三 09:46]--[2016-09-14 周三 10:20] =>  0:34
   :END:
** STARTED [[http://www.liaoxuefeng.com/wiki/0014316089557264a6b348958f449949df42a6d3a2e542c000][廖雪峰]]
   :LOGBOOK:
   CLOCK: [2017-03-15 周三 22:52]--[2017-03-15 周三 23:17] =>  0:25
   CLOCK: [2017-03-15 周三 22:20]--[2017-03-15 周三 22:45] =>  0:25
   CLOCK: [2017-03-14 周二 23:25]--[2017-03-14 周二 23:50] =>  0:25
   CLOCK: [2017-03-14 周二 22:52]--[2017-03-14 周二 23:17] =>  0:25
   CLOCK: [2017-03-14 周二 13:21]--[2017-03-14 周二 13:46] =>  0:25
   CLOCK: [2017-03-14 周二 12:21]--[2017-03-14 周二 12:30] =>  0:09
   CLOCK: [2017-03-06 周一 13:11]--[2017-03-06 周一 13:36] =>  0:25
   CLOCK: [2017-01-24 周二 19:43]--[2017-01-24 周二 20:08] =>  0:25
   CLOCK: [2016-12-12 周一 22:55]--[2016-12-12 周一 23:20] =>  0:25
   CLOCK: [2016-09-24 周六 12:59]--[2016-09-24 周六 13:25] =>  0:26
   CLOCK: [2016-09-24 周六 11:58]--[2016-09-24 周六 12:09] =>  0:11
   CLOCK: [2016-09-22 周四 14:55]--[2016-09-22 周四 15:20] =>  0:25 匿名函数
   CLOCK: [2016-09-21 周三 09:16]--[2016-09-21 周三 09:41] =>  0:25 迭代器
   CLOCK: [2016-09-20 周二 14:26]--[2016-09-20 周二 14:51] =>  0:25 列表生成式
   CLOCK: [2016-09-20 周二 13:27]--[2016-09-20 周二 13:53] =>  0:26
   :END:
* AI
** STARTED computer vision
   :LOGBOOK:
   CLOCK: [2017-03-02 周四 22:23]--[2017-03-02 周四 22:48] =>  0:25
   CLOCK: [2017-02-08 周三 12:07]--[2017-02-08 周三 12:32] =>  0:25
   CLOCK: [2017-02-06 周一 11:51]--[2017-02-06 周一 12:16] =>  0:25
   CLOCK: [2017-02-05 周日 12:59]--[2017-02-05 周日 13:24] =>  0:25
   CLOCK: [2017-01-25 周三 21:05]--[2017-01-25 周三 21:30] =>  0:25
   CLOCK: [2017-01-25 周三 18:59]--[2017-01-25 周三 19:24] =>  0:25
   CLOCK: [2017-01-25 周三 18:26]--[2017-01-25 周三 18:31] =>  0:05
   CLOCK: [2017-01-25 周三 10:10]--[2017-01-25 周三 10:35] =>  0:25
   CLOCK: [2017-01-24 周二 21:32]--[2017-01-24 周二 21:57] =>  0:25
   :END:
** STARTED [[http://opencv-python-tutroals.readthedocs.io/en/latest/py_tutorials/py_tutorials.html][openCV_PyTutorials]]
* TODO MongoDB
** STARTED [[http://www.runoob.com/mongodb/mongodb-relationships.html][简单教程]]
   :LOGBOOK:
   CLOCK: [2016-09-13 周二 16:16]--[2016-09-13 周二 16:48] =>  0:32
   :END:
* TODO sports
  SCHEDULED: <2016-09-14 周三 +1d>
  :PROPERTIES:
  :LAST_REPEAT: [2016-09-13 周二 13:09]
  :END:
  :LOGBOOK:
  - State "DONE"       from "TODO"       [2016-09-13 周二 13:09]
  - State "DONE"       from "TODO"       [2016-09-12 周一 08:51]
  :END:
* TODO git
** [[http://memoryboxes.github.io/blog/2014/12/07/duo-ge-gitzhang-hao-zhi-jian-de-qie-huan/][多个账号切换]]
* STARTED [[https://www.zhihu.com/question/22076666/answer/69638270][bitcoin]]
  :LOGBOOK:
  CLOCK: [2016-10-05 周三 13:28]--[2016-10-05 周三 13:53] =>  0:25
  CLOCK: [2016-09-23 周五 09:43]--[2016-09-23 周五 10:08] =>  0:25
  CLOCK: [2016-09-22 周四 15:53]--[2016-09-22 周四 16:18] =>  0:25
  CLOCK: [2016-09-20 周二 18:28]--[2016-09-20 周二 18:53] =>  0:25
  :END:
* ui
** 评论的图标
** 评论的大小
** 详情的线
** 修改头像的弹出框
** 视频回复里的图标
** 系统消息，圆角,阴影
** 聊天框高度，矮一些
* 计算机
** [[http://scse.buaa.edu.cn/buaa-css-web/articleDetail.action;jsessionid=DBFB2A8FE1CD0441D85FC0F7057D0C83?articleId=2bff0a2e-f114-4853-9bd3-dd6515a98bff&type=NEWS&firstSelId=6e011b46-2c70-4f68-a633-ec51f42b4718&secondSelId=NOTICE_PUBLICITY&language=0][专业课大纲]]
** STARTED [[https://www.coursera.org/learn/jisuanji-biancheng/lecture/IB2qK/zheng-shu-xing-de-cun-chu][C语言程序设计]]
   :LOGBOOK:
   CLOCK: [2017-03-12 周日 22:55]--[2017-03-12 周日 23:20] =>  0:25
   CLOCK: [2017-03-11 周六 18:07]--[2017-03-11 周六 18:32] =>  0:25
   CLOCK: [2017-03-09 周四 23:09]--[2017-03-09 周六 23:32] => 0:25
   CLOCK: [2017-03-08 周三 22:00]--[2017-03-08 周三 22:25] =>  0:25 整型数据
   :END:
** STARTED [[https://www.coursera.org/learn/unity-yinqing-youxi-kaifa/lecture/xlbGz/ben-men-ke-cheng-jie-shao][Unity]]
   :LOGBOOK:
   CLOCK: [2017-03-10 周五 23:43]--[2017-03-11 周六 00:08] =>  0:25
   CLOCK: [2017-03-09 周四 22:35]--[2017-03-09 周四 23:00] =>  0:25
   CLOCK: [2017-03-08 周三 22:37]--[2017-03-08 周三 23:02] =>  0:25
   :END:
